In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv(r'data/ds_salaries.csv')

#### Preprocesamiento

In [3]:
df.head(3)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S

In [14]:
df.columns #saber columnas

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [15]:
df.shape #saber las dimensiones

(3755, 11)

In [16]:
df.dtypes #saber los tipos de datos

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [17]:
df.isnull().sum() #saber los valores nulos

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [31]:
df.duplicated().sum() #saber los valores duplicados

np.int64(1171)

In [34]:
duplicados=pd.DataFrame(df.value_counts())
duplicados[duplicados['count']>1]

                                                                                                                                                                    count
work_year experience_level employment_type job_title            salary salary_currency salary_in_usd employee_residence remote_ratio company_location company_size
2022      SE               FT              Data Scientist       191475 USD             191475        US                 100          US               M                21
                                                                141525 USD             141525        US                 100          US               M                21
2023      SE               FT              Data Engineer        252000 USD             252000        US                 0            US               M                13
                                                                129000 USD             129000        US                 0            US               M                13
2022      SE               FT              Data Engineer        130000 USD             130000        US                 0            US               M                12
...                                                                                                                                                                   ...
                                           Data Scientist       119300 USD             119300        US                 0            US               L                 2
2023      SE               FT              Data Quality Analyst 100000 USD             100000        US                 0            US               M                 2
                                                                80000  USD             80000         US                 0            US               M                 2
2022      EN               FT              Data Analyst         50000  USD             50000         US                 50           US               L                 2
2023      MI               FT              Data Analyst         85000  USD             85000         US                 0            US               M                 2

[544 rows x 1 columns]

In [35]:
df.drop_duplicates(inplace=True) #eliminar duplicados

In [36]:
df.shape

(2584, 11)

### EDA

In [37]:
df.head(1)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L

¿de que pais son la mayoria de compañias?

En que puesto se gana mas

Tipo de trabajo, pais de residencia donde mas se cobra?

¿El nivel de  experiencia es proporcional al salario?

cuanto se cobra de media por cada nivel de experiencia?

en qué tamaño de compañía trabajan más

por que porcentage promedio se aumenta el salario entre nivel de experiencia

en que pais se cobra  mas por tipo de empleo?

nivel de expriencia mas requerido

cuáles se repiten más en este set de datos, las empresas medianas, grandes o pequeñas